Repository: Frews2/SistemaDistribuidoCheckers
Catalog: CheckersClient/CheckersCliente/Properties/Resources.*.resx
Languages: es_mx, it

# AnswerQuestion
source: Answer
es_mx: Respuesta
it: Rispondere

source: Cancel
es_mx: Cancelar
it: Annulla

# ChangePassword
source: Change your password
es_mx: Cambio de contraseña
it: Modifica della password

source: Confirmation question
es_mx: Pregunta de confirmación
it: Domanda di conferma

source: E-mail
es_mx: Correo

# EnterMail
source: Enter your e-mail
es_mx: Introduce tu correo
it: Inserisci il tuo indirizzo email

# EnterNickname
source: Enter your nickname
es_mx: Introduce tu apodo
it: Inserisci il tuo soprannome

# EnterPin
source: Enter your Pin
es_mx: Introduce el pin
it: Inserire il pin

source: Forgot password?
es_mx: ¿Olvido su contraseña?
it: Hai dimenticato la password?

source: Language
es_mx: Lenguaje
it: Linguaggio

source: Games Lost
es_mx: Partidas Perdidas
it: Partite Perse

source: Games Played
es_mx: Partidas Jugadas
it: Partite Giocate

source: Games Won
es_mx: Partidas Ganadas
it: Partite Vinti

source: Log in
es_mx: Inicio
it: Accesso

source: Message
es_mx: Mensaje
it: Messaggio

source: Nickname
es_mx: Apodo
it: Soprannome

# NicknameInstructions
source: Enter your nickname to receive a confirmation pin on your linked mail and change your password
es_mx: Ingrese su apodo para recibir un pin de confirmación en su correo vinculado y cambiar su contraseña
it: Inserisci il tuo nickname per ricevere un pin di conferma sulla tua posta collegata e cambiare la password

source: Password
es_mx: Contraseña
it: Parola d'ordine

source: Play
es_mx: Jugar
it: Giocare

source: Rank
es_mx: Posición
it: Posizione

source: Ranking
es_mx: Clasificacion
it: Classifica

# Register
source: Register new account
es_mx: Registrar nueva cuenta
it: Registrare l'account

source: Resend e-mail
es_mx: Reenviar correo
it: Rinvia l'e-mail

source: Rules
es_mx: Reglas
it: Regole

source: Send mail
es_mx: Enviar correo
it: Inviare una mail

# Rankings
source: Rankings Table
es_mx: Puntuaciones
it: Classifiche

source: Registration Date
es_mx: Fecha de Registración
it: Data di Registrazione

# Return
source: Go Back
es_mx: Regresar
it: Ritornare

source: Send
es_mx: Enviar
it: Inviare

source: User
es_mx: Usuario
it: Utente

source: Verify account
es_mx: Verificar cuenta
it: Verifica account

# VerifyPassword
source: Confirm Password
es_mx: Confirmar contraseña
it: Conferma password

# WaitMessage
source: Please wait till the timer ends to resend the mail
es_mx: Espere hasta que termine el temporizador para reenviar el correo
it: Attendi il termine del timer per inviare nuovamente la posta

# GameRules
source: Checkers is a two player game. Each player receives 12 colored discs at the start of the game, with black and red as the colors. The board consists of 64 squares, 32 dark and 32 light. Each of the pieces is placed on the 12 dark squares closest to the player. The black player always moves first, then each player takes turns. The only moves allowed are on the dark squares, which means that the pieces always move diagonally. Single pieces can only advance towards their opponent. Any player making a non-capturing move can only move one square at a time. A capture move or jump involves jumping over one of the opponent's pieces in a diagonal line. In a single jump, only one piece can be captured although multiple jumps or the catches can be made in one turn. Any captured pieces are removed from the board. Whenever the capture option is available, the player must make the leap. In cases where more than one capture is possible, the player can choose which jump to make. When a player's piece manages to reach the opponent's front row, he is crowned and made "king". The kings are distinguished from the other pieces by having a crown symbol at the top. While kings can still only move diagonally, they can move back and forth. Kings can jump in multiple directions within the same turn. Individual pieces on the other hand can change direction diagonally, although they are limited to one move forward. The game ends when a player can no longer make any moves. This can result from all of a player's pieces being captured or blocked from making further moves.
es_mx: Checkers es un juego de dos jugadores. Cada jugador recibe 12 discos de colores al comienzo del juego, con negro y rojo como colores. El tablero consta de 64 casillas, 32 oscuras y 32 claras. Cada una de las piezas se coloca en los 12 cuadrados oscuros más cercanos al jugador. El jugador negro siempre se mueve primero, luego cada jugador se turna. Los únicos movimientos permitidos es que las piezas siempre se mueven en diagonal. Las piezas individuales solo pueden avanzar hacia su oponente. Cualquier jugador que haga un movimiento de no captura solo puede moverse un cuadrado a la vez. Un movimiento de captura o salto implica saltar sobre una de las piezas del oponente en línea diagonal. En un solo salto, solo se puede capturar una pieza aunque múltiples saltos o las capturas se pueden realizar en un turno. Todas las piezas capturadas se eliminan del tablero. Siempre que la opción de captura esté disponible, el jugador debe dar el salto. En los casos en que sea posible más de una captura, el jugador puede elegir qué salto realizar. Cuando la pieza de un jugador logra llegar a la primera fila del oponente, es coronado "rey". Los reyes se distinguen de las otras piezas por tener un símbolo de corona en la parte superior. Si bien los reyes solo pueden moverse en diagonal, pueden moverse hacia adelante y hacia atrás. Los reyes pueden saltar en varias direcciones en el mismo turno. El juego termina cuando un jugador ya no le quedan fichas. Esto puede ser el resultado de que todas las piezas de un jugador sean capturadas.
it: Checkersa è un gioco per due giocatori. Ogni giocatore riceve 12 dischi colorati all'inizio del gioco, con il nero e il rosso come colori. Il tabellone è composto da 64 quadrati, 32 scuri e 32 chiari. Ciascuno dei pezzi viene posizionato sui 12 quadrati scuri più vicini al giocatore. Il giocatore nero si muove sempre per primo, poi ogni giocatore si alterna. Le uniche mosse consentite sono sui quadrati scuri, il che significa che i pezzi si muovono sempre in diagonale. I pezzi singoli possono solo avanzare verso il loro avversario. Qualsiasi giocatore che effettua una mossa non catturante può muovere solo una casella alla volta. Una mossa o un salto di cattura implica il salto sopra uno dei pezzi dell'avversario in linea diagonale. In un singolo salto, solo un pezzo può essere catturato sebbene più salti oppure le catture possono essere effettuate in un solo turno. Qualsiasi pezzo catturato viene rimosso dal tabellone. Ogni volta che è disponibile l'opzione per la cattura, il giocatore deve fare il salto. Nei casi in cui è possibile più di una cattura, il giocatore può scegliere quale salto effettuare. Quando il pezzo di un giocatore riesce a raggiungere la prima fila dell'avversario, viene incoronato e reso “re”. I re si distinguono dagli altri pezzi per avere un simbolo della corona in alto. Mentre i re possono ancora muoversi solo in diagonale,possono spostarsi avanti e indietro. I re possono saltare in più direzioni all'interno dello stesso turno. I singoli pezzi d'altra parte possono cambiare direzione in diagonale, sebbene siano limitati a un movimento in avanti. Il gioco termina quando un giocatore non può più fare mosse. Questo può derivare da tutti i pezzi di un giocatore catturato o bloccato dall'effettuare ulteriori mosse.

source: Player data
es_mx: Datos del jugador
it: Dati del giocatore

source: Canadian Checkers
es_mx: Checkers Canadienses
it: Checkers Canadese

source: Classic Checkers
es_mx: Checkers Clásicos
it: Checkers Classica

source: Game Mode
es_mx: Modo de Juego
it: Modalità di Gioco

source: Italian Checkers
es_mx: Checkers Italianos
it: Checkers Italiana

source: Suicide Checkers
es_mx: Checkers Suicidas
it: Checkers Suicida

# MatchmakingStandBy
source: Please wait while we found a match for you
es_mx: Espere hasta que se encuentre una partida para usted
it: Aspetta che venga trovata una corrispondenza per te

source: Game
es_mx: Juego
it: Gioco

source: Players
es_mx: Jugadores
it: Giocatori

source: Accuser
es_mx: Acusador
it: Accusatore

# ReportAdministration
source: Player Reports Administration
es_mx: Gestión de Reportes de Jugadores
it: Amministrazione resoconto giocatore

source: Report Description
es_mx: Descripción de Acuso
it: Descrizione del Resoconto

source: Reported
es_mx: Reportado
it: Segnalato

source: Report ID
es_mx: ID Reporte
it: ID Resoconto

source: Exit
es_mx: Salir
it: Uscire

source: View Reports
es_mx: Ver Reportes
it: visualizzare i rapporti

source: Ban
es_mx: Suspendir
it: Interdire

source: Options
es_mx: Opciones
it: Opzioni

# BannedLoginMessage
source: You have been banned. Access Denied.
es_mx: Usted a sido baneado. No tiene acceso al sistemo.
it: Sei stato escluso. Accesso negato.

# DoesNotExistLoginMessage
source: The player you have entered does not exist
es_mx: No existe jugador
it: Il giocatore che hai inserito non esiste

# DuplicateEmailMessage
source: Entered email already exists. Please try another one.
es_mx: Ese correo ya esta registrado favor de utilizar otro
it: L'email inserita esiste già. Per favore, provane un altro.

# DuplicateNicknameMessage
source: Nickname chosen already exists. Please try another one.
es_mx: El nickname ya existe, favor de utilizar otro
it: Il nickname scelto esiste già. Per favore, provane un altro.

# EmailNotSentMessage
source: Could not send email to your account due to an unforeseen error. Please try again.
es_mx: Se ha tenido un error a la hora de enviar el correo, intente mas tarde
it: Impossibile inviare e-mail al tuo account a causa di un errore imprevisto. Per favore riprova.

# EmailSentMessage
source: An email was sent to your provided email account. Please check it.
es_mx: Se ha enviado el correo exitosamente
it: È stata inviata un'e-mail al tuo account e-mail fornito. Per favore controllalo.

# IncorrectPasswordMessage
source: Incorrect Password. Try Again.
es_mx: Verifica tu contraseña ingresado
it: Password errata. Riprova.

# LoadMessage
source: Please wait while info loads
es_mx: Espere mientras se consulta
it: Attendi durante il caricamento

# NoConnectionMessage
source: Could not connect to database. Try again later.
es_mx: No se pudo conectarse a la base de datos
it: Impossibile connettersi al banca dati

# NoInfoMessage
source: No information was found from database
es_mx: No se encuentra informacion
it: Nessuna informazione è stata trovata

# NoMatchFoundErrorMessage
source: An error occurred and we could not find a match. Please try again.
es_mx: Error. No se logro buscar partida. Intente de nuevo
it: Si è verificato un errore e non è stato possibile trovare una partita di gioco. Per favore riprova.

# NotVerifiedMessage
source: Account not verified. Please verify account.
es_mx: No ha verificado su cuenta, porfavor verificarla
it: Account non verificato. Verifica l'account.

# PasswordChangeErrorMessage
source: An error occurred and we could not change your password. Please try again.
es_mx: Ha ocurrido un error a la hora de cambiar contraseña intentar de nuevo porfavor
it: Si è verificato un errore e non è stato possibile modificare la password. Per favore riprova.

# PlayerAlreadyBannedErrorMessage
source: Error. The player is already banned and cannot be banned again.
es_mx: ERROR: El Jugador ya se encuentra en estado de baja.
it: Errore. Il giocatore è già stato bannato e non può essere nuovamente bannato

# PlayerBannedMessage
source: Player banned successfuly
es_mx: Se ha dado de baja al jugador.
it: Giocatore bandito con successo

# SuccessfulPasswordChangeMessage
source: Congratulations. Password changed successfuly.
es_mx: Se ha cambiado la contraseña correctamente
it: Congratulazioni. Password modificata con successo.

# SuccessfulRegisterMessage
source: You have been registered successfully but need to verify your account.
es_mx: Se ha registrado exitosamente, favor de confirmar correo
it: Sei stato registrato con successo ma devi verificare il tuo account.

# SuccessfulVerificationMessage
source: Congratulations. Account verification successful
es_mx: Se ha verificado correctamente tu cuenta
it: Congratulazioni. Verifica dell'account riuscita

# UnableToBanErrorMessage
source: An error occurred and the player was unable to be banned. Try again.
es_mx: ERROR: No se logro dar de baja al jugador reportado.
it: Si è verificato un errore e il giocatore non è stato in grado di essere bannato. Riprova.

# UnexplainedErrorMessage
source: Something unexpected occurred. Try again.
es_mx: A ocurrido un error inesperado, vuelva a intentar
it: È successo qualcosa di inaspettato. Riprova.

# WrongAnswerMessage
source: Wrong answer. Please try again.
es_mx: Respuesta incorrecta. Intente de nuevo.
it: Risposta sbagliata. Per favore riprova.

# WrongPINMessage
source: The entered PIN number is incorrect. Try Again.
es_mx: Verifica tu pin
it: Il numero PIN inserito non è corretto. Riprova.

# ExplainReport
source: Explain your reasons for report
es_mx: Explique las razones del reporte
it: Spiega le ragioni del rapporto

source: Report
es_mx: Reportar
it: Rapporto

# Pass
source: Pass turn
es_mx: Pasar turno
it: Passare il turno

# MinimunLength
source: Una o mas casillas no contienen los elementos minimos suficientes
it: Una o più celle non contengono elementi minimi sufficienti
